#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_route_table_association.public-b: Refreshing state... [id=rtbassoc-03b1789ed430afb11]
module.Public_Subnet_B.aws_subnet.main: Refreshing state... [id=subnet-0b58f276790ff5175]
aws_internet_gateway.igw: Refreshing state... [id=igw-06354c0de486ee34b]
aws_route_table_association.private-b: Refreshing state... [id=rtbassoc-0eff08d2594a50451]
module.Private_Subnet_A.aws_subnet.main: Refreshing state... [id=subnet-0f6197d4cd6996487]
aws_eip.nat-1-eip: Refreshing state... [id=eipalloc-07f4140ee4077a6ba]
aws_route_table.private-tb: Refreshing state... [id=rtb-08d21e2cb782415aa]
aws_nat_gateway.private-NAT: Refreshing state... [id=nat-0ea81342f6e778584]
aws_vpc.main: Refreshing state... [id=vpc-099d5a8dfe925a86b]
aws_route_table.public-rt: Refreshing state... [id=rtb-0d93a1a310377963b]
module.Private_Subnet_B.aws_subnet.main: Refreshing state... [id=subnet-04b9140ac6395d8f5]
aws_route_table_association.private-a: Refreshing state... [id=rtbassoc-0eaca9b985424cd55]
aws_route_table_association.public-a: Refreshing state... [id=rtbassoc-0bfc21a59199dddad]
module.Public_Subnet_A.aws_subnet.main: Refreshing state... [id=subnet-04280c1198e0be74d]
aws_secretsmanager_secret.api_email: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:819383208824:secret:CF_API_EMAIL-test-VMJnUF]
aws_iam_role.task_role: Refreshing state... [id=community-challenge-task-role]
aws_iam_policy.ecs-policy: Refreshing state... [id=arn:aws:iam::819383208824:policy/terraform-20231031214926474500000001]
data.aws_iam_policy_document.ecs-assume-role-role: Reading...
data.aws_iam_policy_document.ecs-assume-role-role: Read complete after 0s [id=258469924]
aws_secretsmanager_secret.zone: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:819383208824:secret:ZONE_ID-test-tUiOnJ]
module.backend-image.aws_ecr_repository.foo: Refreshing state... [id=community-challenge-backend]
module.frontend-image.aws_ecr_repository.foo: Refreshing state... [id=community-challenge-frontend]
aws_ecs_cluster.cc-cluster: Refreshing state... [id=arn:aws:ecs:us-west-2:819383208824:cluster/community-challenge-cluster]
aws_secretsmanager_secret.api_key: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:819383208824:secret:CF_API_KEY-test-LIU6ZC]
aws_iam_role.ecs_role: Refreshing state... [id=community-challenge-ecs-role]
aws_lb_target_group.test: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:819383208824:targetgroup/community-challenge-tg/7cb9378ceea17fe9]
aws_security_group.lb-sg: Refreshing state... [id=sg-0c51cdd062576acd2]
aws_iam_role_policy.task_policy: Refreshing state... [id=community-challenge-task-role:community-challenge-task_policy]
aws_iam_role_policy_attachment.ecs-policy-att: Refreshing state... [id=community-challenge-ecs-role-20231031214927303900000002]
aws_security_group.ecs-sg: Refreshing state... [id=sg-02b3cac387fa08c36]
aws_lb.ecs-lb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:819383208824:loadbalancer/app/community-challenge-lb/8db818ee4a0c5f3b]
aws_ecs_task_definition.service: Refreshing state... [id=community-challenge-family]
aws_ecs_service.cc-service: Refreshing state... [id=arn:aws:ecs:us-west-2:819383208824:service/community-challenge-cluster/community-challenge-service]
aws_lb_listener.ec-lb-listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:819383208824:listener/app/community-challenge-lb/8db818ee4a0c5f3b/501c0f5009c9962a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.cc-service will be updated in-place
  ~ resource "aws_ecs_service" "cc-service" {
        id                                 = "arn:aws:ecs:us-west-2:819383208824:service/community-challenge-cluster/community-challenge-service"
        name                               = "community-challenge-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:819383208824:task-definition/community-challenge-family:23" -> "arn:aws:ecs:us-west-2:819383208824:task-definition/community-challenge-family:19"
        # (15 unchanged attributes hidden)

      - load_balancer {
          - container_name   = "nginx-frontend" -> null
          - container_port   = 80 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:us-west-2:819383208824:targetgroup/community-challenge-tg/7cb9378ceea17fe9" -> null
        }
      + load_balancer {
          + container_name   = "nginx-frontend"
          + container_port   = 80
          + target_group_arn = (known after apply)
        }

      ~ network_configuration {
          ~ security_groups  = [
              - "sg-02b3cac387fa08c36",
            ] -> (known after apply)
          ~ subnets          = [
              - "subnet-04b9140ac6395d8f5",
              - "subnet-0f6197d4cd6996487",
            ] -> (known after apply)
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # aws_eip.nat-1-eip will be destroyed
  # (because aws_eip.nat-1-eip is not in configuration)
  - resource "aws_eip" "nat-1-eip" {
      - allocation_id        = "eipalloc-07f4140ee4077a6ba" -> null
      - association_id       = "eipassoc-01a8a778927377abb" -> null
      - domain               = "vpc" -> null
      - id                   = "eipalloc-07f4140ee4077a6ba" -> null
      - network_border_group = "us-west-2" -> null
      - network_interface    = "eni-025de595b526e141d" -> null
      - private_dns          = "ip-10-0-0-189.us-west-2.compute.internal" -> null
      - private_ip           = "10.0.0.189" -> null
      - public_dns           = "ec2-44-232-157-20.us-west-2.compute.amazonaws.com" -> null
      - public_ip            = "44.232.157.20" -> null
      - public_ipv4_pool     = "amazon" -> null
      - tags                 = {} -> null
      - tags_all             = {} -> null
      - vpc                  = true -> null
    }

  # aws_internet_gateway.igw will be destroyed
  # (because aws_internet_gateway.igw is not in configuration)
  - resource "aws_internet_gateway" "igw" {
      - arn      = "arn:aws:ec2:us-west-2:819383208824:internet-gateway/igw-06354c0de486ee34b" -> null
      - id       = "igw-06354c0de486ee34b" -> null
      - owner_id = "819383208824" -> null
      - tags     = {} -> null
      - tags_all = {} -> null
      - vpc_id   = "vpc-099d5a8dfe925a86b" -> null
    }

  # aws_lb.ecs-lb will be updated in-place
  ~ resource "aws_lb" "ecs-lb" {
        id                                          = "arn:aws:elasticloadbalancing:us-west-2:819383208824:loadbalancer/app/community-challenge-lb/8db818ee4a0c5f3b"
        name                                        = "community-challenge-lb"
      ~ security_groups                             = [
          - "sg-0c51cdd062576acd2",
        ] -> (known after apply)
      ~ subnets                                     = [
          - "subnet-04280c1198e0be74d",
          - "subnet-0b58f276790ff5175",
        ] -> (known after apply)
        tags                                        = {
            "Environment" = "production"
            "Project"     = "community-challenge"
        }
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lb_listener.ec-lb-listener will be updated in-place
  ~ resource "aws_lb_listener" "ec-lb-listener" {
        id                = "arn:aws:elasticloadbalancing:us-west-2:819383208824:listener/app/community-challenge-lb/8db818ee4a0c5f3b/501c0f5009c9962a"
        tags              = {
            "Project" = "community-challenge"
        }
        # (5 unchanged attributes hidden)

      ~ default_action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:us-west-2:819383208824:targetgroup/community-challenge-tg/7cb9378ceea17fe9" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # aws_lb_target_group.test must be replaced
-/+ resource "aws_lb_target_group" "test" {
      ~ arn                                = "arn:aws:elasticloadbalancing:us-west-2:819383208824:targetgroup/community-challenge-tg/7cb9378ceea17fe9" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/community-challenge-tg/7cb9378ceea17fe9" -> (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:us-west-2:819383208824:targetgroup/community-challenge-tg/7cb9378ceea17fe9" -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
      ~ load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> (known after apply)
        name                               = "community-challenge-tg"
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
        tags                               = {
            "Environment" = "production"
            "Project"     = "community-challenge"
        }
      ~ vpc_id                             = "vpc-099d5a8dfe925a86b" # forces replacement -> (known after apply) # forces replacement
        # (10 unchanged attributes hidden)

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 5 -> null
          - interval            = 30 -> null
          - matcher             = "200" -> null
          - path                = "/" -> null
          - port                = "traffic-port" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 5 -> null
          - unhealthy_threshold = 2 -> null
        }

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
        }

      - target_failover {}
    }

  # aws_nat_gateway.private-NAT will be destroyed
  # (because aws_nat_gateway.private-NAT is not in configuration)
  - resource "aws_nat_gateway" "private-NAT" {
      - allocation_id                      = "eipalloc-07f4140ee4077a6ba" -> null
      - association_id                     = "eipassoc-01a8a778927377abb" -> null
      - connectivity_type                  = "public" -> null
      - id                                 = "nat-0ea81342f6e778584" -> null
      - network_interface_id               = "eni-025de595b526e141d" -> null
      - private_ip                         = "10.0.0.189" -> null
      - public_ip                          = "44.232.157.20" -> null
      - secondary_allocation_ids           = [] -> null
      - secondary_private_ip_address_count = 0 -> null
      - secondary_private_ip_addresses     = [] -> null
      - subnet_id                          = "subnet-04280c1198e0be74d" -> null
      - tags                               = {} -> null
      - tags_all                           = {} -> null
    }

  # aws_route_table.private-tb will be destroyed
  # (because aws_route_table.private-tb is not in configuration)
  - resource "aws_route_table" "private-tb" {
      - arn              = "arn:aws:ec2:us-west-2:819383208824:route-table/rtb-08d21e2cb782415aa" -> null
      - id               = "rtb-08d21e2cb782415aa" -> null
      - owner_id         = "819383208824" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-0ea81342f6e778584"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {} -> null
      - tags_all         = {} -> null
      - vpc_id           = "vpc-099d5a8dfe925a86b" -> null
    }

  # aws_route_table.public-rt will be destroyed
  # (because aws_route_table.public-rt is not in configuration)
  - resource "aws_route_table" "public-rt" {
      - arn              = "arn:aws:ec2:us-west-2:819383208824:route-table/rtb-0d93a1a310377963b" -> null
      - id               = "rtb-0d93a1a310377963b" -> null
      - owner_id         = "819383208824" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = "igw-06354c0de486ee34b"
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {} -> null
      - tags_all         = {} -> null
      - vpc_id           = "vpc-099d5a8dfe925a86b" -> null
    }

  # aws_route_table_association.private-a will be destroyed
  # (because aws_route_table_association.private-a is not in configuration)
  - resource "aws_route_table_association" "private-a" {
      - id             = "rtbassoc-0eaca9b985424cd55" -> null
      - route_table_id = "rtb-08d21e2cb782415aa" -> null
      - subnet_id      = "subnet-0f6197d4cd6996487" -> null
    }

  # aws_route_table_association.private-b will be destroyed
  # (because aws_route_table_association.private-b is not in configuration)
  - resource "aws_route_table_association" "private-b" {
      - id             = "rtbassoc-0eff08d2594a50451" -> null
      - route_table_id = "rtb-08d21e2cb782415aa" -> null
      - subnet_id      = "subnet-04b9140ac6395d8f5" -> null
    }

  # aws_route_table_association.public-a will be destroyed
  # (because aws_route_table_association.public-a is not in configuration)
  - resource "aws_route_table_association" "public-a" {
      - id             = "rtbassoc-0bfc21a59199dddad" -> null
      - route_table_id = "rtb-0d93a1a310377963b" -> null
      - subnet_id      = "subnet-04280c1198e0be74d" -> null
    }

  # aws_route_table_association.public-b will be destroyed
  # (because aws_route_table_association.public-b is not in configuration)
  - resource "aws_route_table_association" "public-b" {
      - id             = "rtbassoc-03b1789ed430afb11" -> null
      - route_table_id = "rtb-0d93a1a310377963b" -> null
      - subnet_id      = "subnet-0b58f276790ff5175" -> null
    }

  # aws_security_group.ecs-sg must be replaced
-/+ resource "aws_security_group" "ecs-sg" {
      ~ arn                    = "arn:aws:ec2:us-west-2:819383208824:security-group/sg-02b3cac387fa08c36" -> (known after apply)
      ~ id                     = "sg-02b3cac387fa08c36" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Allow public access"
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0c51cdd062576acd2",
                ]
              - self             = false
              - to_port          = 80
            },
          + {
              + cidr_blocks      = []
              + description      = "Allow public access"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 80
            },
        ]
        name                   = "frontend-container"
      + name_prefix            = (known after apply)
      ~ owner_id               = "819383208824" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      ~ vpc_id                 = "vpc-099d5a8dfe925a86b" # forces replacement -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # aws_security_group.lb-sg must be replaced
-/+ resource "aws_security_group" "lb-sg" {
      ~ arn                    = "arn:aws:ec2:us-west-2:819383208824:security-group/sg-0c51cdd062576acd2" -> (known after apply)
      ~ id                     = "sg-0c51cdd062576acd2" -> (known after apply)
        name                   = "load-balancer-sg"
      + name_prefix            = (known after apply)
      ~ owner_id               = "819383208824" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      ~ vpc_id                 = "vpc-099d5a8dfe925a86b" # forces replacement -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # aws_vpc.main will be destroyed
  # (because aws_vpc.main is not in configuration)
  - resource "aws_vpc" "main" {
      - arn                                  = "arn:aws:ec2:us-west-2:819383208824:vpc/vpc-099d5a8dfe925a86b" -> null
      - assign_generated_ipv6_cidr_block     = false -> null
      - cidr_block                           = "10.0.0.0/16" -> null
      - default_network_acl_id               = "acl-030bfdc29449e3549" -> null
      - default_route_table_id               = "rtb-036681aa15125761f" -> null
      - default_security_group_id            = "sg-062366653c4a47e6e" -> null
      - dhcp_options_id                      = "dopt-0514c764cf395adc5" -> null
      - enable_dns_hostnames                 = false -> null
      - enable_dns_support                   = true -> null
      - enable_network_address_usage_metrics = false -> null
      - id                                   = "vpc-099d5a8dfe925a86b" -> null
      - instance_tenancy                     = "default" -> null
      - ipv6_netmask_length                  = 0 -> null
      - main_route_table_id                  = "rtb-036681aa15125761f" -> null
      - owner_id                             = "819383208824" -> null
      - tags                                 = {} -> null
      - tags_all                             = {} -> null
    }

  # module.Private_Subnet_A.aws_subnet.main will be destroyed
  # (because aws_subnet.main is not in configuration)
  - resource "aws_subnet" "main" {
      - arn                                            = "arn:aws:ec2:us-west-2:819383208824:subnet/subnet-0f6197d4cd6996487" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-west-2a" -> null
      - availability_zone_id                           = "usw2-az1" -> null
      - cidr_block                                     = "10.0.2.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0f6197d4cd6996487" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "819383208824" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {} -> null
      - tags_all                                       = {} -> null
      - vpc_id                                         = "vpc-099d5a8dfe925a86b" -> null
    }

  # module.Private_Subnet_B.aws_subnet.main will be destroyed
  # (because aws_subnet.main is not in configuration)
  - resource "aws_subnet" "main" {
      - arn                                            = "arn:aws:ec2:us-west-2:819383208824:subnet/subnet-04b9140ac6395d8f5" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-west-2b" -> null
      - availability_zone_id                           = "usw2-az2" -> null
      - cidr_block                                     = "10.0.3.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-04b9140ac6395d8f5" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "819383208824" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {} -> null
      - tags_all                                       = {} -> null
      - vpc_id                                         = "vpc-099d5a8dfe925a86b" -> null
    }

  # module.Public_Subnet_A.aws_subnet.main will be destroyed
  # (because aws_subnet.main is not in configuration)
  - resource "aws_subnet" "main" {
      - arn                                            = "arn:aws:ec2:us-west-2:819383208824:subnet/subnet-04280c1198e0be74d" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-west-2a" -> null
      - availability_zone_id                           = "usw2-az1" -> null
      - cidr_block                                     = "10.0.0.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-04280c1198e0be74d" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "819383208824" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {} -> null
      - tags_all                                       = {} -> null
      - vpc_id                                         = "vpc-099d5a8dfe925a86b" -> null
    }

  # module.Public_Subnet_B.aws_subnet.main will be destroyed
  # (because aws_subnet.main is not in configuration)
  - resource "aws_subnet" "main" {
      - arn                                            = "arn:aws:ec2:us-west-2:819383208824:subnet/subnet-0b58f276790ff5175" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-west-2b" -> null
      - availability_zone_id                           = "usw2-az2" -> null
      - cidr_block                                     = "10.0.1.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0b58f276790ff5175" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "819383208824" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {} -> null
      - tags_all                                       = {} -> null
      - vpc_id                                         = "vpc-099d5a8dfe925a86b" -> null
    }

  # module.vpc.aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "Name"         = "community-challenge-VPC-default"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + tags_all               = {
          + "Name"         = "community-challenge-VPC-default"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + egress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + ingress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }
    }

  # module.vpc.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Name"         = "community-challenge-VPC-default"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + tags_all               = {
          + "Name"         = "community-challenge-VPC-default"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.vpc.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"         = "community-challenge-VPC-default"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + tags_all               = {
          + "Name"         = "community-challenge-VPC-default"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"         = "community-challenge-VPC-us-west-2a"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + tags_all             = {
          + "Name"         = "community-challenge-VPC-us-west-2a"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + vpc                  = (known after apply)
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"         = "community-challenge-VPC"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + tags_all = {
          + "Name"         = "community-challenge-VPC"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name"         = "community-challenge-VPC-us-west-2a"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + tags_all                           = {
          + "Name"         = "community-challenge-VPC-us-west-2a"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"         = "community-challenge-VPC-private"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + tags_all         = {
          + "Name"         = "community-challenge-VPC-private"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"         = "community-challenge-VPC-public"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + tags_all         = {
          + "Name"         = "community-challenge-VPC-public"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"         = "community-challenge-VPC-private-us-west-2a"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + tags_all                                       = {
          + "Name"         = "community-challenge-VPC-private-us-west-2a"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"         = "community-challenge-VPC-private-us-west-2b"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + tags_all                                       = {
          + "Name"         = "community-challenge-VPC-private-us-west-2b"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"         = "community-challenge-VPC-public-us-west-2a"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + tags_all                                       = {
          + "Name"         = "community-challenge-VPC-public-us-west-2a"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"         = "community-challenge-VPC-public-us-west-2b"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + tags_all                                       = {
          + "Name"         = "community-challenge-VPC-public-us-west-2b"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"         = "community-challenge-VPC"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + tags_all                             = {
          + "Name"         = "community-challenge-VPC"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
    }

Plan: 22 to add, 3 to change, 17 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @realexcel2021, Action: `pull_request`*